# Воякин Алексей Янович ИУ7-14Б

# Ввод данных
x = float(input("Введите х: "))
while (x <= 0) or (x > 1 ):
    print(" Неверно введенные данные!")
    x = float(input("Введите повторно х: "))
e = float(input("Введите точность: "))
nom = int(input("Введите максимальное кол-во итераций: "))

#Обработка данных
n = 1
y1 = 1
y2 = -3 * x
s = y1
print("   N итерации  |","  текущий член |","текущее значение суммы|")
print("{0:<14.6g}".format(n), "|", "{0:<14.6g}".format(y1), "|", "{0:<14.6g}".format(s), "       |")
while abs(y1) > e and n < nom:
    y1 = y2
    s += y1
    n += 1
    print("{0:<14.6g}".format(n), "|", "{0:<14.6g}".format(y1), "|", "{0:<14.6g}".format(s), "       |")
    y2 = ((-1) ** (n + 2)) * (n + 1) * (n + 2) * (x ** (n)) / 2
    
